rails-4-boilerplate/app/controllers/users_controller.rb

UPDATE "users" SET "updated_at" = $1, "unconfirmed_email" = $2, "confirmation_token" = $3, "confirmation_sent_at" = $4 WHERE "users"."id" = $5
---
  def finish_signup
    # authorize! :update, @user
    if request.patch? && params[:user] #&& params[:user][:email]
      if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
    def set_user
      if current_user
        @user = current_user
      elsif params[:id]
        @user = User.find(params[:id])